In [1]:
prices_a = [8.70, 8.91, 8.71]

In [5]:
(prices_a[1]/prices_a[0])-1

0.024137931034482918

In [6]:
(prices_a[2]/prices_a[1])-1

-0.022446689113355678

In [7]:
#calculating the return as a sequence
print(prices_a[1:])
print(prices_a[:-1])

[8.91, 8.71]
[8.7, 8.91]

In [11]:
# doesn't work because of the way python operates on lists
prices_a[1:]/prices_a[:-1]

TypeError: unsupported operand type(s) for /: 'list' and 'list'

In [10]:
#import numpy
import numpy as np

In [18]:
#create a numpy array for the later days
p1 = np.array(prices_a[1:])

In [17]:
#create a numpy array for the former days
p2 = np.array(prices_a[:-1])

In [20]:
#create returns using numpy
(p1/p2)-1

array([ 0.02413793, -0.02244669])

In [22]:
#you can also use pandas
import pandas as pd

In [28]:
#create a dataframe --> creates a matrix of rows and columns
prices = pd.DataFrame({"BLUE":[8.70, 8.91, 8.71, 8.43, 8.73],
                       "ORANGE":[10.66, 11.08, 10.71, 11.59, 12.11]
                      })

In [29]:
prices

   BLUE  ORANGE
0  8.70   10.66
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59
4  8.73   12.11

In [32]:
prices.iloc[1:]

   BLUE  ORANGE
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59
4  8.73   12.11

In [33]:
prices.iloc[:-1]

   BLUE  ORANGE
0  8.70   10.66
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59

In [35]:
#this example divides by the column index, which creates this weird result
prices.iloc[1:]/prices.iloc[:-1]

   BLUE  ORANGE
0   NaN     NaN
1   1.0     1.0
2   1.0     1.0
3   1.0     1.0
4   NaN     NaN

In [39]:
# .values just gets the values as an array, which allows for computations on the arrays
# as long as one of the selections doesn't have an index (i.e., .values is used), it will produce the same result
(prices.iloc[1:].values/prices.iloc[:-1])-1

       BLUE    ORANGE
0  0.024138  0.039400
1 -0.022447 -0.033394
2 -0.032147  0.082166
3  0.035587  0.044866

In [40]:
prices

   BLUE  ORANGE
0  8.70   10.66
1  8.91   11.08
2  8.71   10.71
3  8.43   11.59
4  8.73   12.11

In [43]:
#produces a calcualtion by shifting the values by1
(prices/prices.shift(1))-1

       BLUE    ORANGE
0       NaN       NaN
1  0.024138  0.039400
2 -0.022447 -0.033394
3 -0.032147  0.082166
4  0.035587  0.044866

In [44]:
#dataframes has a method to compute this directly
prices.pct_change()

       BLUE    ORANGE
0       NaN       NaN
1  0.024138  0.039400
2 -0.022447 -0.033394
3 -0.032147  0.082166
4  0.035587  0.044866

In [50]:
#load sample file with prices
prices = pd.read_csv('sample_prices.csv')

In [51]:
import os
print(os.getcwd())

/Users/nicholasflores/Documents/GitHub/data-science-python/finance-ml/finance-ml-data